src/Catalogs/ВерсииДополнений/ВерсииДополнений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииДополнений</name>
  <owners>Catalog.Дополнения</owners>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ЗадачиМетеорДополнений/ЗадачиМетеорДополнений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиМетеорДополнений</name>
  <resources>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияДополнения</name>
    <type>
      <types>CatalogRef.ВерсииДополнений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ДатыАктуальностиРасширений/ДатыАктуальностиРасширений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыАктуальностиРасширений</name>
  <resources>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияДополнения</name>
    <type>
      <types>CatalogRef.ВерсииДополнений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Базы1С</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ВерсииДополненийПоЗадачеИБазе/ВерсииДополненийПоЗадачеИБазе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииДополненийПоЗадачеИБазе</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВерсияДополнения</name>
    <type>
      <types>CatalogRef.ВерсииДополнений</types>
    </type>
  </resources>
  <attributes>
    <name>АвторИзменений</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Базы1С</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыИсторииХранилищ/СтатусыИсторииХранилищ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИсторииХранилищ</name>
  <enumValues>
    <name>ЗагрузкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ПредварительнаяПроверка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПереноса</name>
  </enumValues>
  <enumValues>
    <name>Перенос</name>
  </enumValues>
  <enumValues>
    <name>Перенесено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Дополнения/Дополнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Дополнения</name>
  <attributes>
    <name>ТипДополнения</name>
    <type>
      <types>EnumRef.ТипыДополнений</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасширения</name>
    <type>
      <types>EnumRef.ТипыРасширений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаБезРасширенияДляВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВерсииДополнений/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоНовый() И Не ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Владелец) И Не ДополнительныеСвойства.Свойство("ИнтерактивнаяЗапись") Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнено поле ""Владелец""",,,, Отказ);
	КонецЕсли;
	// При записи из формы записываем связанные объекты
	Если ДополнительныеСвойства.Свойство("ИнтерактивнаяЗапись") Тогда
		ЗаписатьСвязанныеДанныеПередЗаписью(ДополнительныеСвойства, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтерактивнаяЗапись = ДополнительныеСвойства.Свойство("ИнтерактивнаяЗапись");
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		УстановитьПривилегированныйРежим(Истина);
		РаботаСДополнениями.ЗаписатьСтатусВерсии(Ссылка, Перечисления.СтатусыИсторииХранилищ.ЗагрузкаДанных);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ИнтерактивнаяЗапись Тогда
		УстановитьПривилегированныйРежим(Истина);
		ЗаписатьСвязанныеДанныеПриЗаписи(ДополнительныеСвойства, Отказ);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	Если ЭтоНовый() Тогда
		НепроверяемыеРеквизиты.Добавить("Владелец");
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьСвязанныеДанныеПередЗаписью(ДопСвойства, Отказ)
	
	Если Не ЗначениеЗаполнено(Владелец) Тогда
		ДополнениеВладелец = Справочники.Дополнения.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ДополнениеВладелец, ДопСвойства, "ТипДополнения, Конфигурация, ТипРасширения");
		ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ИмяФайла).ИмяБезРасширения;
		ДополнениеВладелец.Наименование = ?(ЗначениеЗаполнено(ИмяОбъекта), ИмяОбъекта, ИмяФайлаБезРасширения);
		ДополнениеВладелец.Записать();
		Владелец = ДополнениеВладелец.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСвязанныеДанныеПриЗаписи(ДопСвойства, Отказ)
	
	ЗадачаМетеор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопСвойства, "ЗадачаМетеор");
	Если ЗначениеЗаполнено(ЗадачаМетеор) Тогда
		ЗаписьЗадачиДополнений = РегистрыСведений.ЗадачиМетеорДополнений.СоздатьМенеджерЗаписи();
		ЗаписьЗадачиДополнений.ВерсияДополнения = Ссылка;
		ЗаписьЗадачиДополнений.ЗадачаМетеор = ЗадачаМетеор;
		ЗаписьЗадачиДополнений.Записать(Истина);
	КонецЕсли;
	
	ДатыАктуальностиРасширения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопСвойства, "ДатыАктуальностиРасширения", Новый Массив);
	НаборДатыАктуальности = РегистрыСведений.ДатыАктуальностиРасширений.СоздатьНаборЗаписей();
	НаборДатыАктуальности.Отбор.ВерсияДополнения.Установить(Ссылка);
	Для Каждого СтруктураДатыАктуальности Из ДатыАктуальностиРасширения Цикл
		// ДатыАктуальностиРасширений
		ЗаписьДатыАктуальности = НаборДатыАктуальности.Добавить();
		ЗаписьДатыАктуальности.ВерсияДополнения = Ссылка;
		ЗаписьДатыАктуальности.База = СтруктураДатыАктуальности.База;
		ЗаписьДатыАктуальности.ДатаАктуальности = СтруктураДатыАктуальности.ДатаАктуальности;
		// ВерсииДополненийПоЗадачеИБазае
		ВерсииПоЗадачеИбазе = РегистрыСведений.ВерсииДополненийПоЗадачеИБазе.СоздатьМенеджерЗаписи();
		ВерсииПоЗадачеИбазе.Период = ТекущаяДатаСеанса();
		ВерсииПоЗадачеИбазе.ЗадачаМетеор = ЗадачаМетеор;
		ВерсииПоЗадачеИбазе.База = СтруктураДатыАктуальности.База;
		ВерсииПоЗадачеИбазе.ВерсияДополнения = Ссылка;
		ВерсииПоЗадачеИбазе.АвторИзменений = Пользователи.ТекущийПользователь();
		ВерсииПоЗадачеИбазе.Записать();
	КонецЦикла;
	НаборДатыАктуальности.Записать();
	
	АдресДанныхДополнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопСвойства, "АдресДанныхДополнения", "");
	Если ДопСвойства.ЭтоНовый И Не ЭтоАдресВременногоХранилища(АдресДанныхДополнения) Тогда
		ВызватьИсключение "Для новых дополнений обязательно прикрепление файла."
	ИначеЕсли ДопСвойства.ЭтоНовый Тогда
		// Новое дополнение и добавлен файл
		РеквизитыФайла = Новый Структура;
		ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла(РеквизитыФайла);
		ПараметрыФайла.ВладелецФайлов = Ссылка;
		ПараметрыФайла.Автор = Автор;
		ПараметрыФайла.ИмяБезРасширения = Наименование;
		ПараметрыФайла.РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла);
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресДанныхДополнения);
	ИначеЕсли ЭтоАдресВременногоХранилища(АдресДанныхДополнения) Тогда
		// Существующее дополнение. Обновляем файл.
		ПрисоединенныеФайлы = Новый Массив;
		РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(Ссылка, ПрисоединенныеФайлы);
		ИнформацияОФайле = Новый Структура;
		ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", АдресДанныхДополнения);
		ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
		ИнформацияОФайле.Вставить("ИмяБезРасширения", Наименование);
		ИнформацияОФайле.Вставить("Расширение", ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла));
		Для Каждого ПрисоединенныйФайл Из ПрисоединенныеФайлы Цикл
			РаботаСФайлами.ОбновитьФайл(ПрисоединенныйФайл, ИнформацияОФайле);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
